import re

patterns = [
    r'^\d{3}-\d{3}-\d{4}$',
    r'^\d{10}$',
    r'^\d{3} \d{3} \d{4}$',
    r'^\d-\d{3}-\d{3}-\d{4}$',
    r'^\(\d{3}\) \d{3}-\d{4}$',
    r'^\d{3}-\d{3}-\d{4}$',
    r'^\d{3} \d{3} \d{4}$',
    r'^\(\d{3}\) \d{3}-\d{4}$'
]

texts = [
    "123-123-1234",
    "1231231234123123",
    "123 123 1234",
    "1-123-123-1234",
    "(123) 123-1234",
    "999-999-9999",
    "555 555 5555",
    "(555) 555-5555",
    "9999999999",
    "abc-def-ghij",  # Недопустимый формат
    "12-34-5678",     # Недопустимый формат (недостаточное количество цифр)
    "(456) 789",      # Недопустимый формат (недостаточное количество цифр)
    "123 45 67890",   # Недопустимый формат (слишком много цифр)
    "12 345 678 90",  # Недопустимый формат (слишком много цифр)
    "123/123/1234",
    "123-123-12345123"
]

for text in texts:
    if any(re.fullmatch(pattern, text) for pattern in patterns):
        print(f'Соответствует формату: {text}')
    else:
        print(f'Не соответствует формату: {text}')